[
{"type": "paper", "id": "Coordinated-actor-model-of-self-adaptive-traffic-Bagheri-Sirjani/45ee43eb193409c96107c5aa76e8668a62312ee8", "title": "Coordinated actor model of self-adaptive track-based traffic control systems", "authors": ["Maryam Bagheri", "Marjan Sirjani", "Ehsan Khamespanah", "Narges Khakpour", "Ilge Akkaya", "Ali Movaghar-Rahimabadi", "Edward A. Lee"], "date": "2018", "abstract": "Self-adaptation is a well-known technique to handle growing complexities of software systems, where a system autonomously adapts itself in response to changes in a dynamic and unpredictable environment. With the increasing need for developing self-adaptive systems, providing a model and an implementation platform to facilitate integration of adaptation mechanisms into the systems and assuring their safety and quality is crucial. In this paper, we target Track-based Traffic Control Systems (TTCSs) in which the traffic flows through pre-specified sub-tracks and is coordinated by a traffic controller. We introduce a coordinated actor model to design self-adaptive TTCSs and provide a general mapping between various TTCSs and the coordinated actor model. The coordinated actor model is extended to build large-scale self-adaptive TTCSs in a decentralized setting. We also discuss the benefits of using Ptolemy II as a framework for model-based development of large-scale self-adaptive systems that supports designing multiple hierarchical MAPE-K feedback loops interacting with each other. We propose a template based on the coordinated actor model to design a self-adaptive TTCS in Ptolemy II that can be instantiated for various TTCSs. We enhance the proposed template with a predictive adaptation feature. We illustrate applicability of the coordinated actor model and consequently the proposed template by designing two real-life case studies in the domains of air traffic control systems and railway traffic control systems in Ptolemy II. ", "references": ["A-survey-on-engineering-approaches-for-systems-Krupitzer-Roth/d64163ac9d7ad5bffda3d2cb78bd56319d65cfb6", "Stochastic-game-analysis-and-latency-awareness-for-C%C3%A1mara-Moreno/719a78cc3e88ee775d4b3a0c8232763abfcd4150", "Probabilistic-Verification-at-Runtime-for-Systems-Filieri-Tamburrelli/49a2b8f197272e34c5a174e303b7159e864019aa", "Incremental-Runtime-Verification-of-Probabilistic-Forejt-Kwiatkowska/0aff76e19803943175c4dd293ce51e7f97e08ad8", "Run-time-efficient-probabilistic-model-checking-Filieri-Ghezzi/74caebaafddeb27814f6f572638ffbaf6872b762", "A-Component-Architecture-for-the-Internet-of-Things-Brooks-Jerady/c5752fb41feb1be2a1c8c88650351867f1bea50e", "Comparing-Model-Based-Predictive-Approaches-to-and-Moreno-Papadopoulos/bd5902a7526ba71beb25cd428bb844c37cddb47a", "Formal-Design-and-Verification-of-Self-Adaptive-Arcaini-Riccobene/c3681656b53cea3cd9e9854a1be082c2d3cc4d50", "Adaptation-impact-and-environment-models-for-C%C3%A1mara-Lopes/8641be8daff5b24e98a0d68138a61456853aef82", "Coordinated-Actors-for-Reliable-Self-adaptive-Bagheri-Akkaya/861de9c40b7734ddba735a8edb4599a87b8887bb"]},
{"type": "paper", "id": "Fair-Allocation-of-Indivisible-Goods%3A-Improvements-Ghodsi-Hajiaghayi/03d557598397d14727803987982c749fbfe1704b", "title": "Fair Allocation of Indivisible Goods: Improvements and Generalizations", "authors": ["Mohammad Ghodsi", "Mohammad Taghi Hajiaghayi", "Masoud Seddighin", "Saeed Seddighin", "Hadi Yami"], "date": "2018", "abstract": "We study the problem of fair allocation for indivisible goods. We use the maxmin share paradigm introduced by Budish~\\citeBudish:first as a measure for fairness. \\procacciafirst ~\\citeProcaccia:first were the first to investigate this fundamental problem in the additive setting. They show that a maxmin guarantee (1-$\\MMS$ allocation) is not always possible even when the number of agents is limited to 3. While the existence of an approximation solution (e.g. a $1/2$-$\\MMS$ allocation) is quite straightforward, improving the guarantee becomes subtler for larger constants. \\sprocacciafirst ~\\citeProcaccia:first provide a proof for the existence of a $2/3$-$\\MMS$ allocation and leave the question open for better guarantees. Our main contribution is an answer to the above question. We improve the result of \\sprocacciafirst~to a $3/4$ factor in the additive setting. The main idea for our $3/4$-$\\MMS$ allocation method is clustering the agents. To this end, we introduce three notions and techniques, namely reducibility, matching allocation, and cycle-envy-freeness, and prove the approximation guarantee of our algorithm via non-trivial applications of these techniques. Our analysis involves coloring and double counting arguments that might be of independent interest. One major shortcoming of the current studies on fair allocation is the additivity assumption on the valuations. We alleviate this by extending our results to the case of submodular, fractionally subadditive, and subadditive settings. More precisely, we give constant approximation guarantees for submodular and XOS agents, and a logarithmic approximation for the case of subadditive agents. Furthermore, we complement our results by providing close upper bounds for each class of valuation functions. Finally, we present algorithms to find such allocations for additive, submodular, and XOS settings in polynomial time. The reader can find a summary of our results in Table \\refresultstable. ", "references": ["Approximation-Algorithms-for-Computing-Maximin-Amanatidis-Markakis/67a102d6e4737159f6f2ac669a411b30f4bfbaea", "Fair-Enough%3A-Guaranteeing-Approximate-Maximin-Kurokawa-Procaccia/9796e13dd3beb885dccf70b010b30c40e33642a4"]},
{"type": "paper", "id": "Domino-Temporal-Data-Prefetcher-Bakhshalipour-Lotfi-Kamran/665c0dde22c2f8598869d690d59c9b6d84b07c01", "title": "Domino Temporal Data Prefetcher", "authors": ["Mohammad Bakhshalipour", "Pejman Lotfi-Kamran", "Hamid Sarbazi-Azad"], "date": "2018", "abstract": "Big-data server applications frequently encounter data misses, and hence, lose significant performance potential. One way to reduce the number of data misses or their effect is data prefetching. As data accesses have high temporal correlations, temporal prefetching techniques are promising for them. While state-of-the-art temporal prefetching techniques are effective at reducing the number of data misses, we observe that there is a significant gap between what they offer and the opportunity. This work aims to improve the effectiveness of temporal prefetching techniques. We identify the lookup mechanism of existing temporal prefetchers responsible for the large gap between what they offer and the opportunity. Existing lookup mechanisms either not choose the right stream in the history, or unnecessarily delay the stream selection, and hence, miss the opportunity at the beginning of every stream. In this work, we introduce Domino prefetching to address the limitations of existing temporal prefetchers. Domino prefetcher is a temporal data prefetching technique that logically looks up the history with both one and two last miss addresses to find a match for prefetching. We propose a practical design for Domino prefetcher that employs an Enhanced Index Table that is indexed by just a single miss address. We show that Domino prefetcher captures more than 90% of the temporal opportunity. Through detailed evaluation targeting a quad-core processor and a set of server workloads, we show that Domino prefetcher improves system performance by 16% over the baseline with no data prefetcher and 6% over the state-of- the-art temporal data prefetcher. ", "references": ["Identifying-Hierarchical-Structure-in-Sequences%3A-A-Nevill-Manning-Witten/02aca8223525caa99efc4b0e2810e450ee6776ba", "Clearing-the-clouds%3A-a-study-of-emerging-scale-out-Ferdman-Adileh/8b10b13fb495101d1e4eb768907cff05e3bd9315", "Practical-off-chip-meta-data-for-temporal-memory-Wenisch-Ferdman/2b51020e54a6361316cc477c39a2759902022580", "Temporal-memory-streaming-Wenisch/adc43c28e86d5f577e3b4b2ff120162a7225b1f0", "Data-cache-prefetching-using-a-global-history-Nesbit-Smith/3933d3380710680865441c87a22d691ba751a2ef", "Performance-of-Database-Workloads-on-Shared-Memory-Ranganathan-Gharachorloo/04dba1bd51e8f3348c57cb7b5148abd9f4b5aa21", "Linearizing-irregular-memory-accesses-for-improved-Jain-Lin/2aed1e5dab68713bf8ed0fb4b35a0ec67b087c30", "Spatio-temporal-memory-streaming-Somogyi-Wenisch/048336a0dc1029416ce47c78b9a5cba8422e6efd", "Temporal-streams-in-commercial-server-applications-Wenisch-Ferdman/293e7c79a37798032b3047324d101bc49d9a37a2", "Dynamic-Hot-Data-Stream-Prefetching-for-Programs-Chilimbi-Hirzel/60b85b7ee655397a4d2202f9cdf6dd5e3f04f6fd"]},
{"type": "paper", "id": "Deep-Private-Feature-Extraction-Ossia-Taheri/3355aff37b5e4ba40fc689119fb48d403be288be", "title": "Deep Private-Feature Extraction", "authors": ["Seyed Ali Ossia", "Ali Taheri", "Ali Shahin Shamsabadi", "Kleomenis Katevas", "Hamed Haddadi", "Hamid R. Rabiee"], "date": "2018", "abstract": "We present and evaluate Deep Private-Feature Extractor (DPFE), a deep model which is trained and evaluated based on information theoretic constraints. Using the selective exchange of information between a user’s device and a service provider, DPFE enables the user to prevent certain sensitive information from being shared with a service provider, while allowing them to extract approved information using their model. We introduce and utilize the log-rank privacy, a novel measure to assess the effectiveness of DPFE in removing sensitive information and compare different models based on their accuracy-privacy tradeoff. We then implement and evaluate the performance of DPFE on smartphones to understand its complexity, resource demands, and efficiency tradeoffs. Our results on benchmark image datasets demonstrate that under moderate resource utilization, DPFE can achieve high accuracy for primary tasks while preserving the privacy of sensitive information. ", "references": ["Inverting-Visual-Representations-with-Convolutional-Dosovitskiy-Brox/0f4632fc2cf3f574d1e6e75d7d8b90e34bfaaf99", "Deepsecure%3A-scalable-provably-secure-deep-learning-Rouhani-Riazi/d3db19057e2940d65be4a5b3719b43313c23533e", "Replacement-AutoEncoder%3A-A-Privacy-Preserving-for-Malekzadeh-Clegg/65ac236e8ac5a4b0a0742b5101f63c73eafac017", "A-Hybrid-Deep-Learning-Architecture-for-Mobile-Ossia-Shamsabadi/3c4f6d24b55b1fd3c5b85c70308d544faef3f69a", "Deep-Models-Under-the-GAN%3A-Information-Leakage-from-Hitaj-Ateniese/c44177896137e5010a2b336b943c23df1f3f92d3", "Opening-the-Black-Box-of-Deep-Neural-Networks-via-Shwartz-Ziv-Tishby/2efc0a99f13ef8875349ff5d47c278392c39e064", "Privacy-Preserving-Deep-Inference-for-Rich-User-on-Ossia-Shamsabadi/6cefb70f4668ee6c0bf0c18ea36fd49dd60e8365", "SecureML%3A-A-System-for-Scalable-Privacy-Preserving-Mohassel-Zhang/05b073c44188946aeb9c410c1447262cbdf77b6d", "CryptoNets%3A-Applying-Neural-Networks-to-Encrypted-Gilad-Bachrach-Dowlin/272bf24c2c64a856aefc19624245a4698e634117", "Deep-Learning-with-Differential-Privacy-Abadi-Chu/14fed18d838bf6b89d98837837ff314e61ab7c60"]},
{"type": "paper", "id": "Automatic-Access-Control-Based-on-Face-and-Hand-in-Jahromi-Bonderup/2199cb39adbf22b2161cd4f65662e4a152885bae", "title": "Automatic Access Control Based on Face and Hand Biometrics in a Non-cooperative Context", "authors": ["Mohammad Naser Sabet Jahromi", "Morten Bojesen Bonderup", "Maryam Asadi-Aghbolaghi", "Egils Avots", "Kamal Nasrollahi", "Sergio Escalera", "Shohreh Kasaei", "Thomas B. Moeslund", "Gholamreza Anbarjafari"], "date": "2018", "abstract": "Automatic access control systems (ACS) based on the human biometrics or physical tokens are widely employed in public and private areas. Yet these systems, in their conventional forms, are restricted to active interaction from the users. In scenarios where users are not cooperating with the system, these systems are challenged. Failure in cooperation with the biometric systems might be intentional or because the users are incapable of handling the interaction procedure with the biometric system or simply forget to cooperate with it, due to for example, illness like dementia. This work introduces a challenging bimodal database, including face and hand information of the users when they approach a door to open it by its handle in a noncooperative context. We have defined two (an easy and a challenging) protocols on how to use the database. We have reported results on many baseline methods, including deep learning techniques as well as conventional methods on the database. The obtained results show the merit of the proposed database and the challenging nature of access control with non-cooperative users. ", "references": ["A-survey-on-techniques-to-handle-face-recognition-Lahasan-Lutfi/919d08e9645404c60b88f5f5e8511e363ccdf922", "Door-Knob-Hand-Recognition-System-Qu-Zhang/f688f297a52af4f6b44be934a112f4c2296c35f5", "Fingerprint-Recognition-of-Young-Children-Jain-Arora/250a80e0fb57835391b8cc7452f84dfbab70a753", "Long-range-iris-recognition%3A-A-survey-Nguyen-Fookes/6462ef39ca88f538405616239471a8ea17d76259", "On-the-Usability-of-Electroencephalographic-Signals-Yang-Deravi/10d80190b8bebf9364f2417bdaaac4f56730b183", "Face-Recognition-in-Challenging-Environments%3A-An-G%C3%BCnther-Shafey/6fa3857faba887ed048a9e355b3b8642c6aab1d8", "Fusion-of-face-recognition-methods-at-score-level-Cherifi-Cherfaoui/b48a9d018fc4fdb2ddf33e79dc5ee1a3bf0aa91a", "Adaptive-facial-point-detection-and-emotion-for-a-Zhang-Mistry/234c106036964131c0f2daf76c47ced802652046"]}
]